app/controllers/cycles_controller.rb

SELECT "cycles".* FROM "cycles" WHERE "cycles"."user_id" = $1  [["user_id", 2]]
INSERT INTO "cycles" ("created_at", "start_date", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Sat, 01 Mar 2014 21:04:10 UTC +00:00], ["start_date", Fri, 01 Mar 2013], ["updated_at", Sat, 01 Mar 2014 21:04:10 UTC +00:00], ["user_id", 2]]
---
  def create
    @cycle = Cycle.new(cycle_params)
    @cycle.user = current_user
    last_cycle = current_user.cycles.last
    if current_user.cycles.length > 0
      last_cycle.update_attributes(cycle_end_date: @cycle.start_date)
      #find number of days between start date and end date of last cycle to update days attribute
    end
    @cycle.save!