app/controllers/home_controller.rb

SELECT "cycles".* FROM "cycles"
---
  def index
    @cycles = Cycle.all

SELECT "users".* FROM "users"
---
def friend
@users = User.all